In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd
import os

In [2]:
data_path = "cleaned_data.csv"

In [3]:
data = pd.read_csv(data_path)

In [4]:
data.head()

,Unnamed: 0,hhid,year,femaleh,hhsize,f0t6,m0t6,f7t12,m7t12,f13t15,...,Java and Bali,Kalimantan,Sulawesi,%work10t12,%work13t15,%work16t18,%work10t18_x,Childlabour_x,%work10t18_y,Childlabour_y
0,0,1.201160e+11,2005,0,10,0.0,0.0,0.000000,0.000000,0.100000,...,0,0,0,0.0,0.0,0.000000,0.000000,0,0.00,0
1,1,1.201160e+11,2005,0,7,0.0,0.0,0.142857,0.000000,0.000000,...,0,0,0,0.0,0.0,0.000000,0.000000,0,0.25,1
2,2,1.201160e+11,2005,0,6,0.0,0.0,0.000000,0.333333,0.166667,...,0,0,0,0.0,0.0,0.166667,0.166667,1,0.00,0
3,3,1.202050e+11,2005,0,5,0.0,0.0,0.000000,0.000000,0.000000,...,0,0,0,0.0,0.0,0.200000,0.200000,1,0.20,1
4,4,1.202050e+11,2005,0,3,0.0,0.0,0.000000,0.000000,0.000000,...,0,0,0,0.0,0.0,0.000000,0.000000,0,0.00,0

In [5]:
data=data.drop(["Unnamed: 0", "%work10t18_y"], axis=1)

In [6]:
data.head()

,hhid,year,femaleh,hhsize,f0t6,m0t6,f7t12,m7t12,f13t15,f16t18,...,Sumatra,Java and Bali,Kalimantan,Sulawesi,%work10t12,%work13t15,%work16t18,%work10t18_x,Childlabour_x,Childlabour_y
0,1.201160e+11,2005,0,10,0.0,0.0,0.000000,0.000000,0.100000,0.100000,...,1,0,0,0,0.0,0.0,0.000000,0.000000,0,0
1,1.201160e+11,2005,0,7,0.0,0.0,0.142857,0.000000,0.000000,0.142857,...,1,0,0,0,0.0,0.0,0.000000,0.000000,0,1
2,1.201160e+11,2005,0,6,0.0,0.0,0.000000,0.333333,0.166667,0.166667,...,1,0,0,0,0.0,0.0,0.166667,0.166667,1,0
3,1.202050e+11,2005,0,5,0.0,0.0,0.000000,0.000000,0.000000,0.200000,...,1,0,0,0,0.0,0.0,0.200000,0.200000,1,1
4,1.202050e+11,2005,0,3,0.0,0.0,0.000000,0.000000,0.000000,0.000000,...,1,0,0,0,0.0,0.0,0.000000,0.000000,0,0

In [7]:
# Assign X (data) and y (target)
X = data.drop("Childlabour_y", axis=1)
y = data["Childlabour_y"]
print(X.shape, y.shape)

(4353, 36) (4353,)

In [8]:
#Split our data into training and testing

In [9]:
from sklearn.model_selection import train_test_split

In [10]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1)

In [11]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()
classifier

LogisticRegression()

In [12]:
#Fit (train) or model using the training data

In [13]:
classifier.fit(X_train, y_train)

LogisticRegression()

In [14]:
print(f"Training Data Score: {classifier.score(X_train, y_train)}")
print(f"Testing Data Score: {classifier.score(X_test, y_test)}")

Training Data Score: 0.9396446078431373
Testing Data Score: 0.9430670339761249

In [15]:
predictions = classifier.predict(X_test)
print(f"First 10 Predictions:   {predictions[:10]}")
print(f"First 10 Actual labels: {y_test[:10].tolist()}")

First 10 Predictions:   [0 0 0 0 0 0 0 0 0 0]
First 10 Actual labels: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

In [16]:
pd.DataFrame({"Prediction": predictions, "Actual": y_test}).reset_index(drop=True)

      Prediction  Actual
0              0       0
1              0       0
2              0       0
3              0       0
4              0       0
...          ...     ...
1084           0       0
1085           0       1
1086           0       0
1087           0       0
1088           0       0

[1089 rows x 2 columns]